/*Да се разработи програма, която изисква от потребителя да въведе две целочислени числа, x и y, където x < y. 
Да се намери и изведе сумата на числата делящи се на 17 в интервал [x, y].*/

Решение:

#include<stdio.h>
int main(){
	
int x=0;
int y=0;
int sum=0;

printf("въведи x:");
scanf("%d",&x);
	
printf("въведи y:");
scanf("%d",&y);
	
	
	if(x>y){
		printf("Грешка! Грешно въведени стойности...\n");
		return 1;
	}
	
	for(x;x<=y;x++){
		if(x%17==0){
			sum+=x;
		}
	}
	
printf("сумата на числата е: %d\n",sum);

return 0;
}